# Neon PostgreSQL Database Guide

This notebook demonstrates the basics of working with a PostgreSQL database:

1. **Connect** to a Neon PostgreSQL database
2. **Create** a table using SQL
3. **Insert** data using SQL
4. **Query** data and display results
5. **Visualize** the data with charts

Perfect for bootcamp students learning SQL and Python!

## 1. Install Required Dependencies

We'll need a few Python packages to work with our database:

In [1]:
%pip install sqlalchemy pandas python-dotenv psycopg2

Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.12/site-packages (2.0.34)
Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.12/site-packages (2.2.2)
Requirement already satisfied: python-dotenv in /opt/anaconda3/lib/python3.12/site-packages (0.21.0)
Requirement already satisfied: psycopg2 in /opt/anaconda3/lib/python3.12/site-packages (2.9.10)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: numpy>=1.26.0 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

## 2. Import Libraries

Let's import the libraries we'll need for our database work:

In [2]:
import pandas as pd
from sqlalchemy import create_engine, text
import os
from dotenv import load_dotenv

# Load environment variables (for our database credentials)
load_dotenv()

# Get database connection string from environment variable
# Replace with your actual Neon connection string
DATABASE_URL = os.getenv('DATABASE_URL')
DATABASE_URL

'postgresql://neondb_owner:npg_q4HZI0FWdVub@ep-young-frost-a2s979f9-pooler.eu-central-1.aws.neon.tech/neondb?sslmode=require&options=endpoint%3Dep-young-frost-a2s979f9-pooler'

## 3. Connect to the Database

SQLAlchemy helps us connect to our PostgreSQL database. Think of it as a bridge between Python and our database.

In [3]:
# Create a connection to our database
engine = create_engine(DATABASE_URL)

# Test if our connection works
try:
    with engine.connect() as connection:
        result = connection.execute(text("SELECT version()"))
        version = result.fetchone()[0]
        print(f"‚úÖ Connected successfully!")
        print(f"Database version: {version}")  # Show first 50 characters
except Exception as e:
    print(f"‚ùå Connection failed: {e}")
    print("Make sure your DATABASE_URL is correct!")

‚úÖ Connected successfully!
Database version: PostgreSQL 17.5 on aarch64-unknown-linux-gnu, compiled by gcc (Debian 12.2.0-14+deb12u1) 12.2.0, 64-bit

## 4. Create a Table

Now let's create a table to store employee information. We'll use a simple SQL CREATE TABLE statement.

In [4]:
# SQL command to create our employees table
create_table_sql = """
CREATE TABLE IF NOT EXISTS employees (
    id SERIAL PRIMARY KEY,
    name VARCHAR(100) NOT NULL,
    email VARCHAR(100) UNIQUE NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10, 2),
    hire_date DATE,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);
"""

# Execute the SQL command
try:
    with engine.connect() as connection:
        connection.execute(text(create_table_sql))
        connection.commit()
    print("‚úÖ Table 'employees' created successfully!")
except Exception as e:
    print(f"‚ùå Error creating table: {e}")

‚úÖ Table 'employees' created successfully!

## 5. Insert Sample Data

Let's add some sample employees to our table using SQL INSERT statements.

In [5]:
# First, let's check if we already have data
check_data_sql = "SELECT COUNT(*) FROM employees;"

with engine.connect() as connection:
    result = connection.execute(text(check_data_sql))
    count = result.fetchone()[0]
    
if count > 0:
    print(f"üìä Table already has {count} employees")
else:
    # SQL to insert sample data
    insert_data_sql = """
    INSERT INTO employees (name, email, department, salary, hire_date) VALUES
    ('Alice Johnson', 'alice.johnson@company.com', 'Engineering', 75000.00, '2023-01-15'),
    ('Bob Smith', 'bob.smith@company.com', 'Marketing', 65000.00, '2023-02-20'),
    ('Carol Williams', 'carol.williams@company.com', 'Engineering', 82000.00, '2023-01-10'),
    ('David Brown', 'david.brown@company.com', 'Sales', 70000.00, '2023-03-05'),
    ('Eva Davis', 'eva.davis@company.com', 'HR', 68000.00, '2023-02-28'),
    ('Frank Miller', 'frank.miller@company.com', 'Engineering', 90000.00, '2022-12-01'),
    ('Grace Wilson', 'grace.wilson@company.com', 'Marketing', 72000.00, '2023-01-25');
    """
    
    # Execute the insert
    try:
        with engine.connect() as connection:
            connection.execute(text(insert_data_sql))
            connection.commit()
        print("‚úÖ Sample data inserted successfully!")
    except Exception as e:
        print(f"‚ùå Error inserting data: {e}")

üìä Table already has 7 employees

## 6. Query Our Data

Now let's retrieve and display our data using SQL SELECT statements.

In [6]:
# Simple SQL query to get all employees
query_sql = "SELECT * FROM employees ORDER BY hire_date DESC;"

# Use pandas to run the query and display results nicely
employees_df = pd.read_sql_query(query_sql, engine)

print(f"\nüìà We have {len(employees_df)} employees in our database!")

employees_df

üìà We have 7 employees in our database!

,id,name,email,department,salary,hire_date,created_at
0,4,David Brown,david.brown@company.com,Sales,70000.0,2023-03-05,2025-07-15 14:41:52.727240
1,5,Eva Davis,eva.davis@company.com,HR,68000.0,2023-02-28,2025-07-15 14:41:52.727240
2,2,Bob Smith,bob.smith@company.com,Marketing,65000.0,2023-02-20,2025-07-15 14:41:52.727240
3,7,Grace Wilson,grace.wilson@company.com,Marketing,72000.0,2023-01-25,2025-07-15 14:41:52.727240
4,1,Alice Johnson,alice.johnson@company.com,Engineering,75000.0,2023-01-15,2025-07-15 14:41:52.727240
5,3,Carol Williams,carol.williams@company.com,Engineering,82000.0,2023-01-10,2025-07-15 14:41:52.727240
6,6,Frank Miller,frank.miller@company.com,Engineering,90000.0,2022-12-01,2025-07-15 14:41:52.727240

## 7. Let's Explore Our Data

Let's run some interesting SQL queries to learn more about our employees.

In [7]:
# Query 1: Find all Engineering employees
engineering_query = """
SELECT name, salary 
FROM employees 
WHERE department = 'Engineering' 
ORDER BY salary DESC;
"""

engineering_df = pd.read_sql_query(engineering_query, engine)
print("üîß Engineering Employees:")
display(engineering_df)


# Query 2: Calculate average salary by department
avg_salary_query = """
SELECT 
    department,
    COUNT(*) as employee_count,
    ROUND(AVG(salary), 2) as avg_salary,
    MAX(salary) as highest_salary
FROM employees 
GROUP BY department 
ORDER BY avg_salary DESC;
"""

avg_salary_df = pd.read_sql_query(avg_salary_query, engine)
print("üí∞ Average Salary by Department:")
display(avg_salary_df)

üîß Engineering Employees:

             name   salary
0    Frank Miller  90000.0
1  Carol Williams  82000.0
2   Alice Johnson  75000.0

üí∞ Average Salary by Department:

    department  employee_count  avg_salary  highest_salary
0  Engineering               3    82333.33         90000.0
1        Sales               1    70000.00         70000.0
2    Marketing               2    68500.00         72000.0
3           HR               1    68000.00         68000.0

## üéâ Congratulations! You've Completed the Database Tutorial

### What You've Learned:

**üîå Database Connection:**
- ‚úÖ Connected to a PostgreSQL database using SQLAlchemy
- ‚úÖ Used environment variables to keep credentials safe

**üèóÔ∏è Database Operations:**
- ‚úÖ Created a table using SQL `CREATE TABLE`
- ‚úÖ Inserted data using SQL `INSERT`
- ‚úÖ Queried data using SQL `SELECT`
- ‚úÖ Filtered data using `WHERE` clauses
- ‚úÖ Grouped data using `GROUP BY`

**üí° Key SQL Commands You Practiced:**
- `CREATE TABLE` - Make new tables
- `INSERT INTO` - Add new data
- `SELECT` - Get data from tables
- `WHERE` - Filter specific records
- `GROUP BY` - Summarize data by groups
- `ORDER BY` - Sort results

### üöÄ Next Steps for Your Learning Journey:

1. **Practice More SQL**: Try writing your own queries!
2. **Connect Your Own Database**: Replace the placeholder connection string with a real one
3. **Build a Web App**: Run the Streamlit app (`streamlit_app.py`) to see a full application
4. **Learn More**: Explore joins, subqueries, and database design

### üéØ Real-World Applications:
- Building web applications with user data
- Creating data dashboards for businesses  
- Analyzing sales and customer information
- Managing inventory systems
- Building social media applications

**Great job completing this tutorial! You now have the fundamentals to work with databases in Python! üêç‚ú®**

In [8]:
def test_connection(engine):
    try:
        with engine.connect() as connection:
            result = connection.execute(text("SELECT version()"))
            version = result.fetchone()[0]
            print(f"‚úÖ Connected to database successfully!")
            print(f"Database version: {version}")  # Show first 50 characters
            return True
    except Exception as e:
        print(f"‚ùå Database connection failed: {e}")
        print("Make sure your DATABASE_URL is correct!")
        return False

In [9]:
def run_query(engine, query):
    try:
        with engine.connect() as connection:
            connection.execute(text(query))
            connection.commit()
        print(f"‚úÖ Query run successfully!")
    except Exception as e:
        print(f"‚ùå Error running query: {e}")

In [ ]:
DATABASE_SCHEMA = [
    """
    CREATE TABLE IF NOT EXISTS employees (
        id SERIAL PRIMARY KEY,
        name VARCHAR(100) NOT NULL,
        email VARCHAR(100) UNIQUE NOT NULL,
        department VARCHAR(50),
        salary DECIMAL(10, 2),
        hire_date DATE,
        created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP);
    """,
]

In [13]:
def initialize_database(DATABASE_SCHEMA):
    # 1. Open connection with database
    engine = create_engine(DATABASE_URL)
    # 2. Test Connection
    if test_connection(engine):
        # 3. Create schema if it doesn't exist
        for query in DATABASE_SCHEMA:
            # Execute the SQL command
            run_query(engine, query)
    return engine

engine = initialize_database(DATABASE_SCHEMA)

‚úÖ Connected to database successfully!
Database version: PostgreSQL 17.5 on aarch64-unknown-linux-gnu, compiled by gcc (Debian 12.2.0-14+deb12u1) 12.2.0, 64-bit
‚úÖ Query run successfully!